# Loading library

In [3]:
import pandas as pd
import numpy as np

# 1. Create Dataframe

In [3]:
data = {
    'roll_num' : [3,2,7,11],
    'ppr_id': [34,21,10,11],
    'marks' : [30,23,17,27]
    
}
data

{'roll_num': [3, 2, 7, 11],
 'ppr_id': [34, 21, 10, 11],
 'marks': [30, 23, 17, 27]}

In [4]:
df1 = pd.DataFrame(data)
df1

   roll_num  ppr_id  marks
0         3      34     30
1         2      21     23
2         7      10     17
3        11      11     27

# 2.Setting Index

In [8]:
df2 = pd.DataFrame(data,index=['ab','ef','xy','uv'])
df2

    roll_num  ppr_id  marks
ab         3      34     30
ef         2      21     23
xy         7      10     17
uv        11      11     27

# 3.Extracting info

In [11]:
df2.loc['xy']

roll_num     7
ppr_id      10
marks       17
Name: xy, dtype: int64

In [14]:
df2.iloc[:,-1]

ab    30
ef    23
xy    17
uv    27
Name: marks, dtype: int64

In [15]:
df2.iloc[0:2,2:3]

    marks
ab     30
ef     23

# Working on CSV

# 1.Loading data

In [5]:
df = pd.read_csv('C:\\ml\\iris.csv')

In [6]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [7]:
df.head(10)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
5   6            5.4           3.9            1.7           0.4  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa
8   9            4.4           2.9            1.4           0.2  Iris-setosa
9  10            4.9           3.1            1.5           0.1  Iris-setosa

# 2.Data Info

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

# 3. Description

In [9]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

# 4. Data Selection

In [12]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [11]:
df['SepalWidthCm'][:5]

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: SepalWidthCm, dtype: float64

In [13]:
df[['SepalWidthCm']][:5]

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [15]:
df[['SepalWidthCm','PetalWidthCm']][:5]

   SepalWidthCm  PetalWidthCm
0           3.5           0.2
1           3.0           0.2
2           3.2           0.2
3           3.1           0.2
4           3.6           0.2

In [16]:
df[['SepalWidthCm','PetalWidthCm']].head()

   SepalWidthCm  PetalWidthCm
0           3.5           0.2
1           3.0           0.2
2           3.2           0.2
3           3.1           0.2
4           3.6           0.2

In [19]:
df.iloc[:10,2:3]

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6
5           3.9
6           3.4
7           3.4
8           2.9
9           3.1

In [21]:
df.iloc[:10,[2,3]]

   SepalWidthCm  PetalLengthCm
0           3.5            1.4
1           3.0            1.4
2           3.2            1.3
3           3.1            1.5
4           3.6            1.4
5           3.9            1.7
6           3.4            1.4
7           3.4            1.5
8           2.9            1.4
9           3.1            1.5

# 5. Missing Values

## 5.1 NULL values

In [24]:
data = {
    'roll_num' : [3,2,7,11],
    'ppr_id': [34,21,10,11],
    'marks' : [np.nan,23,17,27]
    
}
data

{'roll_num': [3, 2, 7, 11],
 'ppr_id': [34, 21, 10, 11],
 'marks': [nan, 23, 17, 27]}

In [27]:
df1 = pd.DataFrame(data)
df1

   roll_num  ppr_id  marks
0         3      34    NaN
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

## 5.2 isnull

In [29]:
df1.isnull()

   roll_num  ppr_id  marks
0     False   False   True
1     False   False  False
2     False   False  False
3     False   False  False

In [31]:
df1.isnull().sum()

roll_num    0
ppr_id      0
marks       1
dtype: int64

## 5.3fillna

In [33]:
df2 = df1.fillna(1)
df2

   roll_num  ppr_id  marks
0         3      34    1.0
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

## 5.4 Dropping NULL values

In [34]:
a = df1.dropna()
a

   roll_num  ppr_id  marks
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

In [35]:
df1

   roll_num  ppr_id  marks
0         3      34    NaN
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

In [36]:
a = df1.dropna(axis = 0)#drop row
a

   roll_num  ppr_id  marks
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

In [39]:
a = df1.dropna(axis = 1)#drop col
a

   roll_num  ppr_id
0         3      34
1         2      21
2         7      10
3        11      11

## 5.5 Creating a data with non null values

In [42]:
a = pd.notnull(df1['marks'])
a

0    False
1     True
2     True
3     True
Name: marks, dtype: bool

In [45]:
df1[a]

   roll_num  ppr_id  marks
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

# 6. statistics

In [4]:
data = {
    'roll_num' : [3,2,7,11],
    'ppr_id': [34,21,10,11],
    'marks' : [np.nan,23,17,27]
    
}
data

{'roll_num': [3, 2, 7, 11],
 'ppr_id': [34, 21, 10, 11],
 'marks': [nan, 23, 17, 27]}

In [7]:
df1 = pd.DataFrame(data)
df1

   roll_num  ppr_id  marks
0         3      34    NaN
1         2      21   23.0
2         7      10   17.0
3        11      11   27.0

In [8]:
df1['marks'].sum()

67.0

In [10]:
df1['marks'].mean()

22.333333333333332

In [11]:
df1['marks'].cumsum()

0     NaN
1    23.0
2    40.0
3    67.0
Name: marks, dtype: float64

In [12]:
df1['roll_num'].count()

4

In [13]:
df1['marks'].min()

17.0

In [14]:
df1['marks'].max()

27.0

In [15]:
df1['marks'].var()

25.333333333333336

In [16]:
df1['marks'].std()

5.033222956847167

In [17]:
df1.corr()

          roll_num    ppr_id     marks
roll_num  1.000000 -0.740366  0.337797
ppr_id   -0.740366  1.000000  0.195977
marks     0.337797  0.195977  1.000000

# Extra by me

In [18]:
df2 = pd.read_csv('C:\\ml\\iris.csv')
df2

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [20]:
df2.corr()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Id,1.000000,0.716676,-0.397729,0.882747,0.899759
SepalLengthCm,0.716676,1.000000,-0.109369,0.871754,0.817954
SepalWidthCm,-0.397729,-0.109369,1.000000,-0.420516,-0.356544
PetalLengthCm,0.882747,0.871754,-0.420516,1.000000,0.962757
PetalWidthCm,0.899759,0.817954,-0.356544,0.962757,1.000000